public/man/man1/pipewire-pulse.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - pipewire-pulse.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - pipewire-pulse.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>pipewire-pulse - The PipeWire PulseAudio replacement</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>pipewire-pulse</strong> [/options/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>pipewire-pulse</strong> starts a PulseAudio-compatible daemon that integrates
with the PipeWire media server, by running a pipewire process through a
systemd service. This daemon is a drop-in replacement for the PulseAudio
daemon.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-h | –help</strong></p>
<blockquote>
<p>Show help.</p>
</blockquote>
<p>
<strong>-v | –verbose</strong></p>
<blockquote>
<p>Increase the verbosity by one level. This option may be specified
multiple times.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Show version information.</p>
</blockquote>
<p>
<strong>-c | –config=FILE</strong></p>
<blockquote>
<p>Load the given config file (Default: pipewire-pulse.conf).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
ENVIRONMENT VARIABLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The generic <strong>pipewire(1) environment variables</strong> are supported.</p>
<p>
In addition:</p>
<p>
*PULSE_RUNTIME_PATH *</p>
<blockquote>
</blockquote>
<p>
*XDG_RUNTIME_DIR *</p>
<blockquote>
<p>Directory where to create the native protocol pulseaudio socket.</p>
</blockquote>
<p>
*PULSE_LATENCY_MSEC *</p>
<blockquote>
<p>Extra buffering latency in milliseconds. This controls buffering logic
in libpulse and may be set for PulseAudio client applications to adjust
their buffering. (Setting it on the pipewire-pulse server has no
effect.)</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTHORS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>pipewire-pulse.conf(5)</strong>, <strong>pipewire(1)</strong>, <strong>pipewire-pulse-modules(7)</strong></p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
